cf_billing/Documents/бестРегистрацияПоказанийНПОбщий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>бестРегистрацияПоказанийНПОбщий</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>InformationRegister.бестМаксимальныеПоказанияНП</xr:Item>
				<xr:Item>AccumulationRegister.бестОбъемНачисленийНП</xr:Item>
				<xr:Item>InformationRegister.бестПоказанияПриборовУчетаНП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПериодНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Примечание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>200</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидОперации</Name>
					<Type>
						<v8:Type>cfg:EnumRef.бестВидыОпераций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаФактическогоСобытия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ТочкиУчета</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>IDСтрокиТочкиУчета</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Договор</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргДоговорыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОбъектРасчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бестОбъектыРасчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТочкаУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТочкиУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Услуга</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыУслуг</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПриборУчета</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргПриборыУчетаАбонента</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидДифференцированности</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргВидыДифференцированности</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Шкала</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргШкалыПриборовУчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаПоследнихПоказаний</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КоэффициентПУ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>5</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МаксимальноВозможныйОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Переворот</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПереворотИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПредыдущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Разница</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СостояниеПоказаний</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргСостояниеПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийОбъемПотребления</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатусИзмененПользователем</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТарифнаяЗона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.энргТарифныеЗоны</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекущиеПоказания</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтклоненияОтПредМесяца</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтклоненияОтАналогичногоПериодаПредГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПроцентОтклоненияОтСреднегоРасхода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>8</v8:Digits>
									<v8:FractionDigits>4</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаПредМесяц</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РасходЗаАналогичныйПериодПредГода</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СреднийРасход</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>АдресОбъекта</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>500</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПричинаОтклонения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.энргПричиныОтклоненияПоказаний</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопустимыйОбъемОтклонений</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

cf_billing/Documents/бестРегистрацияПоказанийНПОбщий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область ПрограммныйИнтерфейс

// Заполняет список команд отчетов.
// 
// Параметры:
//   КомандыОтчетов - ТаблицаЗначений - состав полей см. в функции МенюОтчеты.СоздатьКоллекциюКомандОтчетов.
//   Параметры		- Структура передаваемых параметров.
//
Процедура ДобавитьКомандыОтчетов(КомандыОтчетов, Параметры= Неопределено) Экспорт
			
КонецПроцедуры

// Описание полей
// ВыводитьВТЧ - необходим для справочника с настройками шаблонов
// Возвращаемое значение:
//	 Соответствие
//
Функция ПолучитьСтатическиеКолонки() Экспорт
	
	СтатическиеКолонки = Новый Соответствие;
	// СтатическиеКолонки.Вставить("IDСтроки"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","IDСтроки"	,ОбщегоНазначения.ОписаниеТипаСтрока(36)				,Тип("УникальныйИдентификатор")	,"IDСтроки" 	,Ложь));
	// СтатическиеКолонки.Вставить("IDСтрокиТочекУчета"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","IDСтрокиТочекУчета"	,ОбщегоНазначения.ОписаниеТипаСтрока(36)				,Тип("УникальныйИдентификатор")	,"IDСтрокиТочекУчета" 	,Ложь));
	СтатическиеКолонки.Вставить("ДатаВремя"	,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","ДатаВремя"	,ОбщегоНазначения.ОписаниеТипаДата(ЧастиДаты.ДатаВремя)	,Тип("Дата")					,"Дата время"	,Истина));
	СтатическиеКолонки.Вставить("BНP"		,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BНP"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BНP"			,Истина));
	СтатическиеКолонки.Вставить("BOC"		,Новый Структура("Имя,Тип,ТипЗнч,Заголовок,ВыводитьВТЧ","BOC"		,ОбщегоНазначения.ОписаниеТипаЧисло(15)					,Тип("Число")					,"BOC"			,Истина));
	
	Возврат СтатическиеКолонки;
КонецФункции

#КонецОбласти

#Область ОбработчикиСобытий	

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	Поля.добавить("Номер");
	Поля.добавить("Дата");
	Поля.добавить("ВидОперации");
	СтандартнаяОбработка = Ложь; 	
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)
	Представление 			="" + Данные.ВидОперации + " №" + Данные.номер + " от " +  Данные.дата;
	СтандартнаяОбработка 	= Ложь;
КонецПроцедуры

Процедура ОбработкаПолученияФормы(ВидФормы, Параметры, ВыбраннаяФорма, ДополнительнаяИнформация, СтандартнаяОбработка)
	
	ЕстьЗначенияЗАполнения  	= Параметры.свойство("ЗначенияЗаполнения");
	
	ВидОперацииВыбран  			= Ложь;
	
	Если ЕстьЗначенияЗАполнения тогда
		ВидОперацииВыбран 		= Параметры.ЗначенияЗаполнения.свойство("видоперации");
	КонецЕсли;
	
	Если ВидФормы = "ФормаОбъекта" Тогда
		СтандартнаяОбработка 	= Ложь;
		если Параметры.свойство("Ключ") тогда
			ВидОперации 		= Параметры.ключ.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРегистрацияПоказанийНПОбщий",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;
		ИначеЕсли  Параметры.свойство("ЗначениеКопирования") тогда
			ВидОперации 		= Параметры.ЗначениеКопирования.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРегистрацияПоказанийНПОбщий",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы; 			
		ИначеЕсли  ЕстьЗначенияЗаполнения и ВидОперацииВыбран тогда
			ВидОперации 		= Параметры.ЗначенияЗаполнения.видоперации;
			ПрефиксФормы  		= бестРаботаСВидамиОперацийСервер.ПрефиксФормы("бестРегистрацияПоказанийНПОбщий",ВидОперации);
			ВыбраннаяФорма 		= "ФормаДокумента" + ПрефиксФормы;			
		иначе
			ВыбраннаяФорма 		= "ОбщаяФорма.бестФормаВыбораОперации";
			Параметры.вставить("ИмяДокумента","бестРегистрацияПоказанийНПОбщий");
			Параметры.вставить("ВыборОперации",Истина);
		КонецЕсли; 		
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура СформироватьПечатнуюФорму(МассивДок, ТабДок = Неопределено, ПоказыватьТекПоказания = Истина) Экспорт
	Если ТабДок = Неопределено Тогда
		ТабДок = Новый ТабличныйДокумент;
	КонецЕсли;
	Макет = Документы.бестРегистрацияПоказанийНПОбщий.ПолучитьМакет("Макет");
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("МассивДок", МассивДок);
	Запрос.УстановитьПараметр("ПоказыватьТекПоказания", ПоказыватьТекПоказания);
	Запрос.Текст = "ВЫБРАТЬ
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.НомерСтроки КАК НомерСтроки,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТочкаУчета КАК ТочкаУчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Услуга КАК Услуга,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПриборУчета КАК ПриборУчета,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ВидДифференцированности КАК ВидДифференцированности,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Шкала КАК Шкала,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ДатаПоследнихПоказаний КАК ДатаПоследнихПоказаний,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.КоэффициентПУ КАК КоэффициентПУ,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.Разница
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК Разница,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПредыдущиеПоказания КАК ПредыдущиеПоказания,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.СостояниеПоказаний
	|		ИНАЧЕ """"
	|	КОНЕЦ КАК СостояниеПоказаний,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТарифнаяЗона КАК ТарифнаяЗона,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.ТекущиеПоказания
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ТекущиеПоказания,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.ПроцентОтклоненияОтПредМесяца
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОтклоненияОтПредМесяца,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.ПроцентОтклоненияОтАналогичногоПериодаПредГода
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОтклоненияОтАналогичногоПериодаПредГода,
	|	ВЫБОР
	|		КОГДА &ПоказыватьТекПоказания
	|			ТОГДА бестРегистрацияПоказанийНПОбщийТочкиУчета.ПроцентОтклоненияОтСреднегоРасхода
	|		ИНАЧЕ 0
	|	КОНЕЦ КАК ПроцентОтклоненияОтСреднегоРасхода,
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК бестРегистрацияПоказанийНПОбщийТочкиУчета
	|ГДЕ
	|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка В(&МассивДок)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Ссылка,
	|	НомерСтроки
	|ИТОГИ ПО
	|	Ссылка
	|АВТОУПОРЯДОЧИВАНИЕ";
	
	РезультатЗапроса = Запрос.Выполнить();
	ВыборкаДок	= РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаДок.Следующий() Цикл
		ТекДок = ВыборкаДок.Ссылка;
		Область = Макет.ПолучитьОбласть("Шапка");	
		Область.Параметры.ВидОперации	= ТекДок.ВидОперации;
		Область.Параметры.НомерДок		= ТекДок.Номер;
		Область.Параметры.ДатаДок		= Формат(ТекДок.Дата,"ДФ=dd.MM.yyyy");
		Область.Параметры.Организация	= ТекДок.Организация;
		ТабДок.Вывести(Область);
		ВыборкаТЧ	=	ВыборкаДок.Выбрать();
		Пока ВыборкаТЧ.Следующий() Цикл
			Область = Макет.ПолучитьОбласть("СтрокаТЧ");
			Область.Параметры.Заполнить(ВыборкаТЧ);
			ТабДок.Вывести(Область);
		КонецЦикла;
		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
	КонецЦикла;
	
	ТабДок.АвтоМасштаб 		= Истина;
	ТабДок.ОтображатьСетку 	= Ложь;

КонецПроцедуры

&НаСервере
Процедура СформироватьПечатнуюФорму53(МассивДок, ТабДок) Экспорт
	Для н = 0 по МассивДок.ВГРаница() Цикл
	
		Запрос = Новый Запрос;
		Запрос.УстановитьПараметр("Ссылка", МассивДок[н]);
		Запрос.Текст = "ВЫБРАТЬ
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Договор КАК Договор,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ОбъектРасчета КАК ОбъектРасчета,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Контрагент КАК Потребитель,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПредыдущиеПоказания КАК НачПоказания,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТекущиеПоказания КАК КонПоказания,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Разница КАК Расход
		|ИЗ
		|	Документ.бестРегистрацияПоказанийНПОбщий.ТочкиУчета КАК бестРегистрацияПоказанийНПОбщийТочкиУчета
		|ГДЕ
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Контрагент,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ОбъектРасчета,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Договор,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ПредыдущиеПоказания,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.ТекущиеПоказания,
		|	бестРегистрацияПоказанийНПОбщийТочкиУчета.Разница";
		Результат = Запрос.Выполнить();
		Выборка = Результат.Выбрать();
		
		Макет = Документы.бестРегистрацияПоказанийНПОбщий.ПолучитьМакет("Форма53");
		
		Шапка = Макет.ПолучитьОбласть("Шапка");
		Шапка.Параметры.НомерДок = МассивДок[н].Номер;
		Шапка.Параметры.ДатаДок = Формат(МассивДок[н].Дата, "ДФ=dd.MM.yyyy");
		ТабДок.Вывести(Шапка);
		
		//Отборы = Макет.ПолучитьОбласть("ШапкаОтборы");
		//ТабДок.Вывести(Отборы);
		
		ШапкаТЧ = Макет.ПолучитьОбласть("ШапкаТЧ");
		ТабДок.Вывести(ШапкаТЧ);
		
		Пока Выборка.Следующий() Цикл
			СтрокаТЧ = Макет.ПолучитьОбласть("СтрокаТЧ");	
			СтрокаТЧ.Параметры.ЗАполнить(ВЫборка);
			ТабДок.Вывести(СтрокаТЧ);
		КонецЦикла;

		ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
		
	КонецЦикла;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
